### Sushanta Shrestha :   Task 4 SQL  : 9.24.2023

In [150]:
# Import the required libraries
import pandas as pd
import sqlite3

In [151]:
# Establish a connection to the SQLite database
connection = sqlite3.connect('books.db')

In [152]:
# Set the max_columns to 10
pd.set_option('display.max_columns', 10)

In [153]:
authors = pd.read_sql('SELECT * FROM authors', connection)
print(authors)

    id      first    last
0    1       Paul  Deitel
1    2     Harvey  Deitel
2    3      Abbey  Deitel
3    4        Dan   Quirk
4    5  Alexander    Wald
5    7        Sue   Black
6    8        Sue   Black
7    9        Sue   Black
8   10        Sue   Black
9   11        Sue   Black
10  12       John     Doe
11  13        Sue     Red
12  14        Sue     Red

In [154]:
pd.read_sql('SELECT * FROM author_ISBN', connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

In [155]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

# Section 1: SELECT. Complete 17.2.2 SELECT

In [156]:
pd.read_sql("SELECT first, last FROM authors", connection)

        first    last
0        Paul  Deitel
1      Harvey  Deitel
2       Abbey  Deitel
3         Dan   Quirk
4   Alexander    Wald
5         Sue   Black
6         Sue   Black
7         Sue   Black
8         Sue   Black
9         Sue   Black
10       John     Doe
11        Sue     Red
12        Sue     Red

# Section 2: WHERE. Complete 17.2.3 WHERE

In [157]:
# Execute an SQL query to fetch specific data from the 'titles' table
# The SQL keywords SELECT are followed by the columns to select.
# The FROM keyword is followed by the table to select the data from.
# The WHERE clause specifies a condition that must be met (in this case, copyright > '2016').
df = pd.read_sql('''
    SELECT title, edition, copyright
    FROM titles
    WHERE copyright > '2016'
''', connection)

# Print the DataFrame
print(df)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

# Section 3: ORDER BY. Complete 17.2.4 ORDER BY

In [158]:

df = pd.read_sql('''
    SELECT id, first, last
    FROM authors
    ORDER BY last DESC, first ASC
''', connection, index_col=['id'])

# Print the DataFrame
print(df)

        first    last
id
5   Alexander    Wald
13        Sue     Red
14        Sue     Red
4         Dan   Quirk
12       John     Doe
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
7         Sue   Black
8         Sue   Black
9         Sue   Black
10        Sue   Black
11        Sue   Black

In [159]:

df = pd.read_sql('''
    SELECT id, first, last
    FROM authors
    ORDER BY last, first
''', connection, index_col=['id'])

# Print the DataFrame
print(df)

        first    last
id
7         Sue   Black
8         Sue   Black
9         Sue   Black
10        Sue   Black
11        Sue   Black
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
12       John     Doe
4         Dan   Quirk
13        Sue     Red
14        Sue     Red
5   Alexander    Wald

In [160]:

df = pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

# Print the DataFrame
print(df)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [161]:


df = pd.read_sql('''
    SELECT isbn, title, edition, copyright
    FROM titles
    WHERE title LIKE '%How to Program'
    ORDER BY title
''', connection)

# Print the DataFrame
print(df)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

# Section 4: INNER JOIN. Complete 17.2.5 INNER JOIN

In [162]:

df = pd.read_sql('''
    SELECT first, last, isbn
    FROM authors
    INNER JOIN author_ISBN
        ON authors.id = author_ISBN.id
    ORDER BY last, first
''', connection)

# Print the first 5 rows of the DataFrame
print(df.head())

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

# Section 5: INSERT INTO. Complete 17.2.6 INSERT INTO

In [163]:
pd.read_sql('SELECT id, first, last FROM authors', connection)

cursor.execute("INSERT INTO authors (first, last) VALUES ('Sue', 'Red')")
connection.commit()

OperationalError: no such table: authors

In [ ]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
7         Sue   Black
8         Sue   Black
9         Sue   Black
10        Sue   Black
11        Sue   Black
12       John     Doe
13        Sue     Red
14        Sue     Red

# Section 6: UPDATE. Complete 17.2.7 UPDATE

In [ ]:


# Execute your query
cursor.execute("UPDATE authors SET first='Updated' WHERE id=6")

# Commit the transaction
connection.commit()

# Print the number of updated rows
print(cursor.rowcount)

# Close the cursor and connection
cursor.close()
connection.close()

OperationalError: no such table: authors

# Section 7: DELETE FROM
# Complete the tasks in 17.2.8 DELETE FROM

In [ ]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

OperationalError: no such table: authors

In [ ]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
7         Sue   Black
8         Sue   Black
9         Sue   Black
10        Sue   Black
11        Sue   Black
12       John     Doe
13        Sue     Red
14        Sue     Red

# Section 8: SELECT. Show your Final Results, SELECT * from each table and display the final state of each of the 3 tables.

In [ ]:

authors_final = pd.read_sql('SELECT * FROM authors', connection)
titles_final = pd.read_sql('SELECT * FROM titles', connection)
author_ISBN_final = pd.read_sql('SELECT * FROM author_ISBN', connection)

In [ ]:
print(authors_final)

    id      first    last
0    1       Paul  Deitel
1    2     Harvey  Deitel
2    3      Abbey  Deitel
3    4        Dan   Quirk
4    5  Alexander    Wald
5    7        Sue   Black
6    8        Sue   Black
7    9        Sue   Black
8   10        Sue   Black
9   11        Sue   Black
10  12       John     Doe
11  13        Sue     Red
12  14        Sue     Red

In [ ]:
titles_final = pd.read_sql('SELECT * FROM titles', connection)
print(titles_final)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [ ]:
print(author_ISBN_final)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302